#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//有1、2、3、4个数字，能组成多少个互不相同且无重复数字的三位数？都是多少？

//int main()
//{
//	int i, j, k;
//	int count = 0;
//	//三重循环-----1、遍历百位，十位，各位	2、设置判断条件（数字不能相同）
//	for (i = 1; i < 5; i++)
//	{
//		for (j = 1; j < 5; j++)
//		{
//			for (k = 1; k < 5; k++)
//			{
//				if (i != j && j != k)
//				{	
//					count++;
//					printf("%d%d%d ", i, j, k);
//				}
//			}
//		}
//		
//	}
//	printf("\n");
//	printf("count=%d\n", count);
//
//	return 0;
//}


//企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，
//低于10万元的部分按10%提成，高于10万元的部分，可可提成7.5%；20万到40万之间时，高于20万元的部分，
//可提成5%；40万到60万之间时高于40万元的部分，可提成3%；60万到100万之间时，高于60万元的部分，
//可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？

int main()
{



	return 0;
}